#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Test_Tariq/gh-actions-demo/runs/run-TDdPxTMUP8EN9Q3U

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
aws_apprunner_service.nginx: Refreshing state... [id=arn:aws:apprunner:us-east-1:511073568994:service/tariq-nginx2/16a126ffdcf54341962f3870b7bd2291]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_apprunner_service.nginx has been deleted
  - resource "aws_apprunner_service" "nginx" {
      - arn                            = "arn:aws:apprunner:us-east-1:511073568994:service/tariq-nginx2/16a126ffdcf54341962f3870b7bd2291" -> null
      - auto_scaling_configuration_arn = "arn:aws:apprunner:us-east-1:511073568994:autoscalingconfiguration/DefaultConfiguration/1/00000000000000000000000000000001" -> null
      - id                             = "arn:aws:apprunner:us-east-1:511073568994:service/tariq-nginx2/16a126ffdcf54341962f3870b7bd2291" -> null
      - service_id                     = "16a126ffdcf54341962f3870b7bd2291" -> null
      - service_name                   = "tariq-nginx2" -> null
      - service_url                    = "gpwbazdbpa.us-east-1.awsapprunner.com" -> null
      - status                         = "RUNNING" -> null
      - tags_all                       = {} -> null

      - health_check_configuration {
          - healthy_threshold   = 1 -> null
          - interval            = 5 -> null
          - path                = "/" -> null
          - protocol            = "TCP" -> null
          - timeout             = 2 -> null
          - unhealthy_threshold = 5 -> null
        }

      - instance_configuration {
          - cpu    = "1024" -> null
          - memory = "2048" -> null
        }

      - network_configuration {
          - egress_configuration {
              - egress_type = "DEFAULT" -> null
            }
        }

      - source_configuration {
          - auto_deployments_enabled = false -> null

          - image_repository {
              - image_identifier      = "public.ecr.aws/nginx/nginx:1-alpine-perl" -> null
              - image_repository_type = "ECR_PUBLIC" -> null

              - image_configuration {
                  - port = "80" -> null
                }
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apprunner_service.nginx will be created
  + resource "aws_apprunner_service" "nginx" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "tariq-nginx5"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags_all                       = (known after apply)

      + health_check_configuration {
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + path                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + instance_configuration {
          + cpu               = (known after apply)
          + instance_role_arn = (known after apply)
          + memory            = (known after apply)
        }

      + network_configuration {
          + egress_configuration {
              + egress_type       = (known after apply)
              + vpc_connector_arn = (known after apply)
            }
        }

      + source_configuration {
          + auto_deployments_enabled = false

          + image_repository {
              + image_identifier      = "public.ecr.aws/nginx/nginx:1-alpine-perl"
              + image_repository_type = "ECR_PUBLIC"

              + image_configuration {
                  + port = "80"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ apprunner_service_nginx = {
      ~ arn                            = "arn:aws:apprunner:us-east-1:511073568994:service/tariq-nginx2/16a126ffdcf54341962f3870b7bd2291" -> (known after apply)
      ~ auto_scaling_configuration_arn = "arn:aws:apprunner:us-east-1:511073568994:autoscalingconfiguration/DefaultConfiguration/1/00000000000000000000000000000001" -> (known after apply)
      ~ health_check_configuration     = [
          - {
              - healthy_threshold   = 1
              - interval            = 5
              - path                = "/"
              - protocol            = "TCP"
              - timeout             = 2
              - unhealthy_threshold = 5
            },
        ] -> (known after apply)
      ~ id                             = "arn:aws:apprunner:us-east-1:511073568994:service/tariq-nginx2/16a126ffdcf54341962f3870b7bd2291" -> (known after apply)
      ~ instance_configuration         = [
          - {
              - cpu               = "1024"
              - instance_role_arn = ""
              - memory            = "2048"
            },
        ] -> (known after apply)
      ~ network_configuration          = [
          - {
              - egress_configuration = [
                  - {
                      - egress_type       = "DEFAULT"
                      - vpc_connector_arn = ""
                    },
                ]
            },
        ] -> (known after apply)
      ~ service_id                     = "16a126ffdcf54341962f3870b7bd2291" -> (known after apply)
      ~ service_name                   = "tariq-nginx2" -> "tariq-nginx5"
      ~ service_url                    = "gpwbazdbpa.us-east-1.awsapprunner.com" -> (known after apply)
      ~ source_configuration           = [
          ~ {
              ~ image_repository             = [
                  ~ {
                      ~ image_configuration   = [
                          ~ {
                              ~ start_command                 = "" -> null
                                # (2 unchanged elements hidden)
                            },
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (3 unchanged elements hidden)
            },
        ]
      ~ status                         = "RUNNING" -> (known after apply)
        tags                           = null
      ~ tags_all                       = {} -> (known after apply)
        # (2 unchanged elements hidden)
    }

```

</details>

*Pushed by: @Tarique-B, Action: `pull_request`*